print("Функция print выводит информацию")
print("# - после этого символа написанное в коде не выполняется, нужен для комментирования кода")
print("в функции print можно делать операции такие как 30 + 20: ", 30 + 20)
print("Можно даже вывести Истина и Ллжь 10 > 2: ", 10 > 2)
a = 24 + 4
print(f"Можно вывести переменную над которой делается операция a =: {a}")
print("f - форматирование вывода {здесь переменная или функция}")
print("end - аргумент функции print означает конец строки \n переход на новую строку")
print("input() для ввода значения в переменную полььзователем")
print("sys модуль питона argv - значения передающиеся полльзователем до выполнения программы")
print("open - открытие файла txt.read() - чтение файла с аргументами только чтения записи и др. "
      "write - запись в файл close - закрытие файла")
print("os.path import exists - проверяет существует ли этот файл")
print("def название функции и в (аргументы): - это объявление функции")
print("return - возвращает значение")

